#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repository["se-services"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"9e7934f3548f56c3085be3f63b6825af20930bebad3859b8fb1e979b2dd916ba\"" -> "W/\"b3c8842f4207ccf85f03f220f2ecf75363d944ad5e2bce70209e96174f2580de\""
        id            = "se-services:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository["tool-simulation"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"089f01058f12e04035877102bd3a429bc1cae550b916acbda32c8467a47b4c13\"" -> "W/\"74b308c133613935468fddd66833063fe79ce07f499a0512f57269dc8d9ff60b\""
        id            = "tool-simulation:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository["website"].github_branch.branch["staging"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"fc58d93b3ea16a79dede125c2bc9cd7dddbddcd70ec05c971f790158ad389f46\"" -> "W/\"8906602e342233383a8e01596611d55c8bf19b3b5aa8c8644f1e537bbc91a51a\""
        id            = "website:staging"
        # (5 unchanged attributes hidden)
    }

  # module.repository_lib_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"b787375386a63627775f65676348944a46696e7387d1e7f59d1a0b407c473eb2\"" -> "W/\"9fb6d032316846cd6bbd53dc952b0d2fcfdeea08a3e4a44555e0a43eaf37f8d0\""
        id            = "lib-template-rust:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"f67fc22e9b471da41a3be5e56b9b79a259b7f8dce63c3bb82b51375b06193d38\"" -> "W/\"d093872795deac1167f74c32f5b7056d0490632aef43ca4f67294d2bc2bdf65c\""
        id            = "lib-router:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"62fe0c1db4271ce392920eeff9fcaa01619525359b2fd66a5a8c11ae74c31e01\"" -> "W/\"cd2073605ae4c6043019766ac64f487db2b4537698e2dc4e18a3c6b2db4d915c\""
        id            = "svc-scheduler:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"8f043cc794d02df5fdc309db95efc851ebc7e72adba5e536f39b209fcbefaebc\"" -> "W/\"1615e8572c945a38a42a6aeb619c784940604fb0febd94f091ecfd1cef95e0ae\""
        id            = "svc-storage:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["python"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"a819d03929c814b35711055e79bbbb0a030a4abc18bc1f807c0a6bc2242ad03e\"" -> "W/\"9417efe96e1a4757f123b564803f2bf0e1cc3da6c0698dbd1ed9d9e3f909adfb\""
        id            = "svc-template-python:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"3f4aad28c356e3a25f58dd5b41712dd8b6a315084d606d006b958136f358be16\"" -> "W/\"a3ad086bf526819789d2fcf411cda67c895c35a3c737091f6b9f9fc3061ed315\""
        id            = "svc-template-rust:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["typescript"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"018f0c951805132b3ad1330ab36b0d1dd342ffdadffca31e24fab56313abe264\"" -> "W/\"dad5ede366066c8600c655d32884cd101dcd239a17196d92032b2112e377b351\""
        id            = "svc-template-typescript:develop"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository["benchmarks"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHzRWt84Bqv9O"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["cla-bot"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHTAbhc4BmmRb"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["se-services"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH6H84M4BtBZe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["se-services"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH6H84M4BtBZp"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tool-simulation"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH_Z3b84Bup88"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tool-simulation"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH_Z3b84Bup8-"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tools"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Jf84BmmRe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcN"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["staging"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcL"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYD"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            SHELL := /bin/bash
            
            DOCKER_NAME      := arrow-lib-rust
            IMAGE_NAME       := lib-rust
            BUILD_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-rust
            BUILD_IMAGE_TAG  := latest
            DOCKER_PORT      := 8080
            HOST_PORT        := 
            
            # We might not have a Cargo.toml file in the root dir
            CARGO_MANIFEST_PATH ?= $(shell find -maxdepth 2 -name Cargo.toml)
            CARGO_INCREMENTAL   ?= 1
            RUSTC_BOOTSTRAP     ?= 0
            RELEASE_TARGET      ?= x86_64-unknown-linux-musl
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            NC     := $(shell echo -e `tput setaf 9`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -e CARGO_INCREMENTAL=$(CARGO_INCREMENTAL) \
                -e RUSTC_BOOTSTRAP=$(RUSTC_BOOTSTRAP) \
                -v "$(PWD):/usr/src/app" \
                -v "$(PWD)/.cargo/registry:/usr/local/cargo/registry" \
                $(2) \
                -t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
                $(1)
            
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            cargo_run = echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo check...$(NC)$(SGR0)"
            else
            cargo_run = $(call docker_run,cargo $(1) --manifest-path "$(CARGO_MANIFEST_PATH)" $(2))
            endif
            
            help:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(NC)$(SGR0)"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Rust$(NC)$(SGR0)"
            	@echo "  $(YELLOW)All cargo commands will use '--manifest-path $(CARGO_MANIFEST_PATH)'$(NC)"
            	@echo "  $(BOLD)build$(SGR0)       -- Run 'cargo build'"
            	@echo "  $(BOLD)release$(SGR0)     -- Run 'cargo build --release --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)publish$(SGR0)     -- Run 'cargo publish --dry-run --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)clean$(SGR0)       -- Run 'cargo clean'"
            	@echo "  $(BOLD)rust-check$(SGR0)  -- Run 'cargo check'"
            	@echo "  $(BOLD)rust-test$(SGR0)   -- Run 'cargo test --all'"
            	@echo "  $(BOLD)rust-clippy$(SGR0) -- Run 'cargo clippy --all -- -D warnings'"
            	@echo "  $(BOLD)rust-fmt$(SGR0)    -- Run 'cargo fmt --all -- --check' to check rust file formats."
            	@echo "  $(BOLD)rust-tidy$(SGR0)   -- Run 'cargo fmt --all' to fix rust file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)TOML$(NC)$(SGR0)"
            	@echo "  $(BOLD)toml-test$(SGR0)   -- Run 'taplo format --check' to validate TOML file formats."
            	@echo "  $(BOLD)toml-tidy$(SGR0)   -- Run 'taplo format' to fix TOML file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Python$(NC)$(SGR0)"
            	@echo "  $(BOLD)python-test$(SGR0) -- Run 'yapf -r -i -vv --style google --exclude '.cargo/registry' .'"
            	@echo "                 to validate python files against Google style guide."
            	@echo "                 Run 'flake8 --exclude '.cargo/registry' .' to validate python files against flake8 style guide."
            	@echo "  $(BOLD)python-tidy$(SGR0) -- Run 'black --extend-exclude .cargo ' to fix python style formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(NC)$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                 to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml | "
            	@echo "                      sort --ignore-case >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Combined targets$(NC)$(SGR0)"
            	@echo "  $(BOLD)test$(SGR0) -- Run targets; rust-check rust-test rust-clippy rust-fmt toml-test python-test cspell-test"
            	@echo "  $(BOLD)tidy$(SGR0) -- Run targets; rust-tidy toml-tidy python-tidy"
            
            	@echo "  $(BOLD)all$(SGR0)  -- Run targets; test build release"
            
            
            # Rust / cargo targets
            check-cargo-registry:
            	if [ ! -d "$(PWD)/.cargo/registry" ]; then mkdir -p "$(PWD)/.cargo/registry" ; fi
            
            build: check-cargo-registry
            	@$(call cargo_run,build)
            
            release:
            	@$(call cargo_run,build,--release --target $(RELEASE_TARGET))
            
            publish:
            	@$(call cargo_run,publish,--dry-run --target $(RELEASE_TARGET))
            
            clean: check-cargo-registry
            	@$(call cargo_run,clean)
            
            rust-check: check-cargo-registry
            	@$(call cargo_run,check)
            
            rust-test: check-cargo-registry
            	@$(call cargo_run,test,--all)
            
            rust-clippy: check-cargo-registry
            	@$(call cargo_run,clippy,--all -- -D warnings)
            
            rust-fmt: check-cargo-registry
            	@echo "$(YELLOW)Running and checking Rust codes formats...$(NC)"
            	@$(call cargo_run,fmt,--all -- --check)
            
            rust-tidy: check-cargo-registry
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call cargo_run,fmt,--all)
            
            # TOML / taplo targets
            toml-test:
            	@echo "$(YELLOW)Running toml file formatting tests...$(NC)"
            	@$(call docker_run,taplo format --check)
            
            toml-tidy:
            	@echo "$(YELLOW)Running toml file formatting fixes...$(NC)"
            	@$(call docker_run,taplo format)
            
            # Python / yapf, flake8 targets
            python-test:
            	@echo "$(YELLOW)Formatting and checking Python files with Google style...$(NC)"
            	@$(call docker_run,yapf -r -i -vv --style google --exclude '.cargo/registry' .)
            	@echo "$(YELLOW)Formatting and checking Python files with flake8 style...$(NC)"
            	@$(call docker_run,flake8 --exclude '.cargo/registry' .)
            
            python-tidy:
            	@echo "$(YELLOW)Running python file formatting fixes...$(NC)"
            	@$(call docker_run,black --extend-exclude .cargo .)
            
            # editorconfig targets
            editorconfig-test:
            	@echo "$(YELLOW)Checking if the codebase is compliant with the .editorconfig file...$(NC)"
            	@docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -v "$(PWD):/usr/src/app" \
                -t mstruebing/editorconfig-checker
            
            # cspell targets
            cspell-test:
            	@echo "$(YELLOW)Checking for spelling errors...$(NC)"
          - 	@cspell --words-only --unique "**/**" -c .cspell.config.yaml
          + 	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            # cspell add words
            cspell-add-words:
            	@echo "$(YELLOW)Adding words to the project's cspell word list...$(NC)"
          - 	@cspell --words-only --unique "**/**" -c .cspell.config.yaml | sort --ignore-case >> .cspell.project-words.txt
          + 	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml | sort --ignore-case >> .cspell.project-words.txt)
            
            # Combined targets
            test: rust-check rust-test rust-clippy rust-fmt toml-test python-test
            tidy: rust-tidy toml-tidy python-tidy
            
            all: test build release
            
        EOT
        id                  = "lib-template-rust/Makefile"
        # (9 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqidv"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqid1"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            SHELL := /bin/bash
            
            DOCKER_NAME      := arrow-lib-router
            IMAGE_NAME       := lib-router
            BUILD_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-rust
            BUILD_IMAGE_TAG  := latest
            DOCKER_PORT      := 8080
            HOST_PORT        := 
            
            # We might not have a Cargo.toml file in the root dir
            CARGO_MANIFEST_PATH ?= $(shell find -maxdepth 2 -name Cargo.toml)
            CARGO_INCREMENTAL   ?= 1
            RUSTC_BOOTSTRAP     ?= 0
            RELEASE_TARGET      ?= x86_64-unknown-linux-musl
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            NC     := $(shell echo -e `tput setaf 9`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -e CARGO_INCREMENTAL=$(CARGO_INCREMENTAL) \
                -e RUSTC_BOOTSTRAP=$(RUSTC_BOOTSTRAP) \
                -v "$(PWD):/usr/src/app" \
                -v "$(PWD)/.cargo/registry:/usr/local/cargo/registry" \
                $(2) \
                -t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
                $(1)
            
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            cargo_run = echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo check...$(NC)$(SGR0)"
            else
            cargo_run = $(call docker_run,cargo $(1) --manifest-path "$(CARGO_MANIFEST_PATH)" $(2))
            endif
            
            help:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(NC)$(SGR0)"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Rust$(NC)$(SGR0)"
            	@echo "  $(YELLOW)All cargo commands will use '--manifest-path $(CARGO_MANIFEST_PATH)'$(NC)"
            	@echo "  $(BOLD)build$(SGR0)       -- Run 'cargo build'"
            	@echo "  $(BOLD)release$(SGR0)     -- Run 'cargo build --release --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)publish$(SGR0)     -- Run 'cargo publish --dry-run --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)clean$(SGR0)       -- Run 'cargo clean'"
            	@echo "  $(BOLD)rust-check$(SGR0)  -- Run 'cargo check'"
            	@echo "  $(BOLD)rust-test$(SGR0)   -- Run 'cargo test --all'"
            	@echo "  $(BOLD)rust-clippy$(SGR0) -- Run 'cargo clippy --all -- -D warnings'"
            	@echo "  $(BOLD)rust-fmt$(SGR0)    -- Run 'cargo fmt --all -- --check' to check rust file formats."
            	@echo "  $(BOLD)rust-tidy$(SGR0)   -- Run 'cargo fmt --all' to fix rust file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)TOML$(NC)$(SGR0)"
            	@echo "  $(BOLD)toml-test$(SGR0)   -- Run 'taplo format --check' to validate TOML file formats."
            	@echo "  $(BOLD)toml-tidy$(SGR0)   -- Run 'taplo format' to fix TOML file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Python$(NC)$(SGR0)"
            	@echo "  $(BOLD)python-test$(SGR0) -- Run 'yapf -r -i -vv --style google --exclude '.cargo/registry' .'"
            	@echo "                 to validate python files against Google style guide."
            	@echo "                 Run 'flake8 --exclude '.cargo/registry' .' to validate python files against flake8 style guide."
            	@echo "  $(BOLD)python-tidy$(SGR0) -- Run 'black --extend-exclude .cargo ' to fix python style formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(NC)$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                 to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml | "
            	@echo "                      sort --ignore-case >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Combined targets$(NC)$(SGR0)"
            	@echo "  $(BOLD)test$(SGR0) -- Run targets; rust-check rust-test rust-clippy rust-fmt toml-test python-test cspell-test"
            	@echo "  $(BOLD)tidy$(SGR0) -- Run targets; rust-tidy toml-tidy python-tidy"
            
            	@echo "  $(BOLD)all$(SGR0)  -- Run targets; test build release"
            
            
            # Rust / cargo targets
            check-cargo-registry:
            	if [ ! -d "$(PWD)/.cargo/registry" ]; then mkdir -p "$(PWD)/.cargo/registry" ; fi
            
            build: check-cargo-registry
            	@$(call cargo_run,build)
            
            release:
            	@$(call cargo_run,build,--release --target $(RELEASE_TARGET))
            
            publish:
            	@$(call cargo_run,publish,--dry-run --target $(RELEASE_TARGET))
            
            clean: check-cargo-registry
            	@$(call cargo_run,clean)
            
            rust-check: check-cargo-registry
            	@$(call cargo_run,check)
            
            rust-test: check-cargo-registry
            	@$(call cargo_run,test,--all)
            
            rust-clippy: check-cargo-registry
            	@$(call cargo_run,clippy,--all -- -D warnings)
            
            rust-fmt: check-cargo-registry
            	@echo "$(YELLOW)Running and checking Rust codes formats...$(NC)"
            	@$(call cargo_run,fmt,--all -- --check)
            
            rust-tidy: check-cargo-registry
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call cargo_run,fmt,--all)
            
            # TOML / taplo targets
            toml-test:
            	@echo "$(YELLOW)Running toml file formatting tests...$(NC)"
            	@$(call docker_run,taplo format --check)
            
            toml-tidy:
            	@echo "$(YELLOW)Running toml file formatting fixes...$(NC)"
            	@$(call docker_run,taplo format)
            
            # Python / yapf, flake8 targets
            python-test:
            	@echo "$(YELLOW)Formatting and checking Python files with Google style...$(NC)"
            	@$(call docker_run,yapf -r -i -vv --style google --exclude '.cargo/registry' .)
            	@echo "$(YELLOW)Formatting and checking Python files with flake8 style...$(NC)"
            	@$(call docker_run,flake8 --exclude '.cargo/registry' .)
            
            python-tidy:
            	@echo "$(YELLOW)Running python file formatting fixes...$(NC)"
            	@$(call docker_run,black --extend-exclude .cargo .)
            
            # editorconfig targets
            editorconfig-test:
            	@echo "$(YELLOW)Checking if the codebase is compliant with the .editorconfig file...$(NC)"
            	@docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -v "$(PWD):/usr/src/app" \
                -t mstruebing/editorconfig-checker
            
            # cspell targets
            cspell-test:
            	@echo "$(YELLOW)Checking for spelling errors...$(NC)"
          - 	@cspell --words-only --unique "**/**" -c .cspell.config.yaml
          + 	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            # cspell add words
            cspell-add-words:
            	@echo "$(YELLOW)Adding words to the project's cspell word list...$(NC)"
          - 	@cspell --words-only --unique "**/**" -c .cspell.config.yaml | sort --ignore-case >> .cspell.project-words.txt
          + 	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml | sort --ignore-case >> .cspell.project-words.txt)
            
            # Combined targets
            test: rust-check rust-test rust-clippy rust-fmt toml-test python-test
            tidy: rust-tidy toml-tidy python-tidy
            
            all: test build release
            
        EOT
        id                  = "lib-router/Makefile"
        # (9 unchanged attributes hidden)
    }

  # module.repository_rust_svc["cargo"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "svc-cargo"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "svc-cargo"
    }

  # module.repository_rust_svc["cargo"].github_branch_protection.all["svc-cargo"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "svc-cargo"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_rust_svc["cargo"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "svc-cargo"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_rust_svc["cargo"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "svc-cargo"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".cargo-husky/hooks/README.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT EDIT! This file was provisioned by Terraform
            
            These hooks will be copied to `.git/hooks/` when `cargo test` is run.
            
            :exclamation: If editing these hooks, you will need to delete the `target/`
            directory and re-run `cargo test`.
        EOT
      + file                = ".cargo-husky/hooks/README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".cargo-husky/hooks/pre-commit"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            ##
            #
            # This hook was set by cargo-husky v1.5.0: https://github.com/rhysd/cargo-husky#readme
            
            # Style templates for console output.
            GREEN=$(tput setaf 2)
            YELLOW=$(tput setaf 3)
            NC=$(tput setaf 9)
            BOLD=$(tput bold)
            SGR0=$(tput sgr0)
            
            echo -e "${BOLD}${YELLOW}Running the pre-commit hook...${NC}${SGR0}"
            
            set -e
            
            # RUST
            make rust-test
            
            # PYTHON 3
            make python-test
            
            # TOML formatting
            make toml-test
            
            # Style Check
            make editorconfig-test
            
            # Spell Check
            make cspell-test
            
            # Finish
            echo "${BOLD}${GREEN}🍺 You are good to go!${NC}${SGR0}"
        EOT
      + file                = ".cargo-husky/hooks/pre-commit"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".cargo-husky/hooks/pre-push"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ### DO NOT EDIT!
            # This file was provisioned by Terraform
            #
            # Do nothing
        EOT
      + file                = ".cargo-husky/hooks/pre-push"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".cargo/config.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # DO NOT EDIT
            # This file was provisioned by Terraform
            
            # https://doc.rust-lang.org/cargo/reference/config.html
            
            [build]
            rustflags = [
              "-Wmissing_docs",
              "-Wmissing_debug_implementations",
              "-Wmissing_copy_implementations",
              "-Wtrivial_casts",
              "-Wtrivial_numeric_casts",
              "-Wunsafe_code",
              "-Wunstable_features",
              "-Wunused_import_braces",
              "-Wunused_qualifications",
            ]
        EOT
      + file                = ".cargo/config.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".cspell.config.yaml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            $schema: https://raw.githubusercontent.com/streetsidesoftware/cspell/main/cspell.schema.json
            version: '0.2'
            language: "en"
            dictionaryDefinitions:
              - name: project-words
                path: './.cspell.project-words.txt'
                addWords: true
            dictionaries: ["project-words"]
            ignorePaths:
              - './.cspell.project-words.txt'
              - '**/vscode-extension/**'
              - '**/.git/**'
              - '**/target/**'
              - '.vscode'
        EOT
      + file                = ".cspell.config.yaml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # EditorConfig helps developers define and maintain consistent
            # coding styles between different editors and IDEs
            # editorconfig.org
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [*.md]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [*.yml]
            indent_size = 2
            [Makefile*]
            indent_style = tab
            indent_size = 4
            
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".github/CODEOWNERS"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".github/workflows/pr_rebase.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            name: PR Rebase
            
            env:
              TERM: xterm
            
            on:
              issue_comment:
                types: [created]
            
            jobs:
              rebase:
                name: Rebase
                if: >-
                  github.event.issue.pull_request != '' &&
                  (
                    contains(github.event.comment.body, '/autosquash') ||
                    contains(github.event.comment.body, '/fixup') ||
                    contains(github.event.comment.body, '/rebase')
                  )
                runs-on: ubuntu-latest
                permissions:
                  issues: write
                  pull-requests: write
                  contents: write
                steps:
                  - name: Checkout the latest code
                    uses: actions/checkout@v3
                    with:
                      token: ${{ secrets.GITHUB_TOKEN }}
                      fetch-depth: 0 # otherwise, you will fail to push refs to dest repo
                  - name: Automatic Rebase
                    uses: cirrus-actions/rebase@1.7
                    with:
                      autosquash: ${{ true }}
                    env:
                      GITHUB_TOKEN: ${{ secrets.GITHUB_TOKEN }}
        EOT
      + file                = ".github/workflows/pr_rebase.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".github/workflows/python_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Python Checks
            
            env:
              TERM: xterm
            
            jobs:
              formatting-check:
                name: Formatting Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make python-test
        EOT
      + file                = ".github/workflows/python_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".github/workflows/rust_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Rust Checks
            
            env:
              TERM: xterm
            
            jobs:
              check:
                name: Checks
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-check
            
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - name: Build
                    run: make build
                  - name: Test
                    run: make rust-test
                  # Coming soon: grcov + push results to website or service (coveralls, etc.)
            
              fmt:
                name: Rustfmt
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-fmt
            
              clippy:
                name: Clippy
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-clippy
        EOT
      + file                = ".github/workflows/rust_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".github/workflows/sanity_checks.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            name: Sanity checks
            
            env:
              TERM: xterm
            
            on:
              push:
                branches:
                  - main
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make editorconfig-test
            
              toml:
                name: TOML format check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make toml-test
            
              cspell:
                name: Spelling check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make cspell-test
        EOT
      + file                = ".github/workflows/sanity_checks.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".gitignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # Generated by Cargo
            # will have compiled files and executables
            debug/
            target/
            # Local cargo cache generated by make targets
            .cargo/registry
            
            # Remove Cargo.lock from gitignore if creating an executable, leave it for libraries
            # More information here https://doc.rust-lang.org/cargo/guide/cargo-toml-vs-cargo-lock.html
            
            
            # These are backup files generated by rustfmt
            **/*.rs.bk
            
            # MSVC Windows builds of rustc generate these, which store debugging information
            *.pdb
            
            # Don't add vscode meta files
            .vscode
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".taplo.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            exclude = ["**/.cargo/registry/**"]
            
            [formatting]
            reorder_keys  = false
            align_entries = true
            
            [[rule]]
            include = ["**/Cargo.toml"]
            keys = [
              "dependencies",
              "dev-dependencies",
              "build-dependencies",
              "target",
              "package",
              "workspace",
              "profile",
              "replace",
              "patch",
              "features",
              "badges",
            ]
            
            [rule.formatting]
            reorder_keys = true
        EOT
      + file                = ".taplo.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files["Makefile"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            SHELL := /bin/bash
            
            DOCKER_NAME      := arrow-lib-cargo
            IMAGE_NAME       := lib-cargo
            BUILD_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-rust
            BUILD_IMAGE_TAG  := latest
            DOCKER_PORT      := 8080
            HOST_PORT        := 8000
            
            # We might not have a Cargo.toml file in the root dir
            CARGO_MANIFEST_PATH ?= $(shell find -maxdepth 2 -name Cargo.toml)
            CARGO_INCREMENTAL   ?= 1
            RUSTC_BOOTSTRAP     ?= 0
            RELEASE_TARGET      ?= x86_64-unknown-linux-musl
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            NC     := $(shell echo -e `tput setaf 9`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -e CARGO_INCREMENTAL=$(CARGO_INCREMENTAL) \
                -e RUSTC_BOOTSTRAP=$(RUSTC_BOOTSTRAP) \
                -v "$(PWD):/usr/src/app" \
                -v "$(PWD)/.cargo/registry:/usr/local/cargo/registry" \
                $(2) \
                -t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
                $(1)
            
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            cargo_run = echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo check...$(NC)$(SGR0)"
            else
            cargo_run = $(call docker_run,cargo $(1) --manifest-path "$(CARGO_MANIFEST_PATH)" $(2))
            endif
            
            help:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(NC)$(SGR0)"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Rust$(NC)$(SGR0)"
            	@echo "  $(YELLOW)All cargo commands will use '--manifest-path $(CARGO_MANIFEST_PATH)'$(NC)"
            	@echo "  $(BOLD)build$(SGR0)       -- Run 'cargo build'"
            	@echo "  $(BOLD)release$(SGR0)     -- Run 'cargo build --release --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)publish$(SGR0)     -- Run 'cargo publish --dry-run --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)clean$(SGR0)       -- Run 'cargo clean'"
            	@echo "  $(BOLD)rust-check$(SGR0)  -- Run 'cargo check'"
            	@echo "  $(BOLD)rust-test$(SGR0)   -- Run 'cargo test --all'"
            	@echo "  $(BOLD)rust-clippy$(SGR0) -- Run 'cargo clippy --all -- -D warnings'"
            	@echo "  $(BOLD)rust-fmt$(SGR0)    -- Run 'cargo fmt --all -- --check' to check rust file formats."
            	@echo "  $(BOLD)rust-tidy$(SGR0)   -- Run 'cargo fmt --all' to fix rust file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)TOML$(NC)$(SGR0)"
            	@echo "  $(BOLD)toml-test$(SGR0)   -- Run 'taplo format --check' to validate TOML file formats."
            	@echo "  $(BOLD)toml-tidy$(SGR0)   -- Run 'taplo format' to fix TOML file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Python$(NC)$(SGR0)"
            	@echo "  $(BOLD)python-test$(SGR0) -- Run 'yapf -r -i -vv --style google --exclude '.cargo/registry' .'"
            	@echo "                 to validate python files against Google style guide."
            	@echo "                 Run 'flake8 --exclude '.cargo/registry' .' to validate python files against flake8 style guide."
            	@echo "  $(BOLD)python-tidy$(SGR0) -- Run 'black --extend-exclude .cargo ' to fix python style formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(NC)$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                 to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml | "
            	@echo "                      sort --ignore-case >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Combined targets$(NC)$(SGR0)"
            	@echo "  $(BOLD)test$(SGR0) -- Run targets; rust-check rust-test rust-clippy rust-fmt toml-test python-test cspell-test"
            	@echo "  $(BOLD)tidy$(SGR0) -- Run targets; rust-tidy toml-tidy python-tidy"
            
            	@echo "  $(BOLD)run$(SGR0)  -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)stop$(SGR0) -- Run 'docker kill ${DOCKER_NAME}-run && docker rm ${DOCKER_NAME}-run' to stop and cleanup our docker after running"
            	@echo "  $(BOLD)all$(SGR0)  -- Run targets; test build release run"
            
            
            # Rust / cargo targets
            check-cargo-registry:
            	if [ ! -d "$(PWD)/.cargo/registry" ]; then mkdir -p "$(PWD)/.cargo/registry" ; fi
            
            build: check-cargo-registry
            	@$(call cargo_run,build)
            
            release:
            	@$(call cargo_run,build,--release --target $(RELEASE_TARGET))
            
            publish:
            	@$(call cargo_run,publish,--dry-run --target $(RELEASE_TARGET))
            
            clean: check-cargo-registry
            	@$(call cargo_run,clean)
            
            rust-check: check-cargo-registry
            	@$(call cargo_run,check)
            
            rust-test: check-cargo-registry
            	@$(call cargo_run,test,--all)
            
            rust-clippy: check-cargo-registry
            	@$(call cargo_run,clippy,--all -- -D warnings)
            
            rust-fmt: check-cargo-registry
            	@echo "$(YELLOW)Running and checking Rust codes formats...$(NC)"
            	@$(call cargo_run,fmt,--all -- --check)
            
            rust-tidy: check-cargo-registry
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call cargo_run,fmt,--all)
            
            # TOML / taplo targets
            toml-test:
            	@echo "$(YELLOW)Running toml file formatting tests...$(NC)"
            	@$(call docker_run,taplo format --check)
            
            toml-tidy:
            	@echo "$(YELLOW)Running toml file formatting fixes...$(NC)"
            	@$(call docker_run,taplo format)
            
            # Python / yapf, flake8 targets
            python-test:
            	@echo "$(YELLOW)Formatting and checking Python files with Google style...$(NC)"
            	@$(call docker_run,yapf -r -i -vv --style google --exclude '.cargo/registry' .)
            	@echo "$(YELLOW)Formatting and checking Python files with flake8 style...$(NC)"
            	@$(call docker_run,flake8 --exclude '.cargo/registry' .)
            
            python-tidy:
            	@echo "$(YELLOW)Running python file formatting fixes...$(NC)"
            	@$(call docker_run,black --extend-exclude .cargo .)
            
            # editorconfig targets
            editorconfig-test:
            	@echo "$(YELLOW)Checking if the codebase is compliant with the .editorconfig file...$(NC)"
            	@docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -v "$(PWD):/usr/src/app" \
                -t mstruebing/editorconfig-checker
            
            # cspell targets
            cspell-test:
            	@echo "$(YELLOW)Checking for spelling errors...$(NC)"
            	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            # cspell add words
            cspell-add-words:
            	@echo "$(YELLOW)Adding words to the project's cspell word list...$(NC)"
            	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml | sort --ignore-case >> .cspell.project-words.txt)
            
            # Combined targets
            test: rust-check rust-test rust-clippy rust-fmt toml-test python-test
            tidy: rust-tidy toml-tidy python-tidy
            
            run: stop
                # Run docker container as a daemon and map a port
            	@$(call docker_run,sh,-d -p $(HOST_PORT):$(DOCKER_PORT))
            
            stop:
            	@docker kill ${DOCKER_NAME}-run || true
            	@docker rm ${DOCKER_NAME}-run || true
            
            all: test build release run
            
        EOT
      + file                = "Makefile"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidt"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            SHELL := /bin/bash
            
            DOCKER_NAME      := arrow-lib-scheduler
            IMAGE_NAME       := lib-scheduler
            BUILD_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-rust
            BUILD_IMAGE_TAG  := latest
            DOCKER_PORT      := 8080
            HOST_PORT        := 8001
            
            # We might not have a Cargo.toml file in the root dir
            CARGO_MANIFEST_PATH ?= $(shell find -maxdepth 2 -name Cargo.toml)
            CARGO_INCREMENTAL   ?= 1
            RUSTC_BOOTSTRAP     ?= 0
            RELEASE_TARGET      ?= x86_64-unknown-linux-musl
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            NC     := $(shell echo -e `tput setaf 9`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -e CARGO_INCREMENTAL=$(CARGO_INCREMENTAL) \
                -e RUSTC_BOOTSTRAP=$(RUSTC_BOOTSTRAP) \
                -v "$(PWD):/usr/src/app" \
                -v "$(PWD)/.cargo/registry:/usr/local/cargo/registry" \
                $(2) \
                -t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
                $(1)
            
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            cargo_run = echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo check...$(NC)$(SGR0)"
            else
            cargo_run = $(call docker_run,cargo $(1) --manifest-path "$(CARGO_MANIFEST_PATH)" $(2))
            endif
            
            help:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(NC)$(SGR0)"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Rust$(NC)$(SGR0)"
            	@echo "  $(YELLOW)All cargo commands will use '--manifest-path $(CARGO_MANIFEST_PATH)'$(NC)"
            	@echo "  $(BOLD)build$(SGR0)       -- Run 'cargo build'"
            	@echo "  $(BOLD)release$(SGR0)     -- Run 'cargo build --release --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)publish$(SGR0)     -- Run 'cargo publish --dry-run --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)clean$(SGR0)       -- Run 'cargo clean'"
            	@echo "  $(BOLD)rust-check$(SGR0)  -- Run 'cargo check'"
            	@echo "  $(BOLD)rust-test$(SGR0)   -- Run 'cargo test --all'"
            	@echo "  $(BOLD)rust-clippy$(SGR0) -- Run 'cargo clippy --all -- -D warnings'"
            	@echo "  $(BOLD)rust-fmt$(SGR0)    -- Run 'cargo fmt --all -- --check' to check rust file formats."
            	@echo "  $(BOLD)rust-tidy$(SGR0)   -- Run 'cargo fmt --all' to fix rust file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)TOML$(NC)$(SGR0)"
            	@echo "  $(BOLD)toml-test$(SGR0)   -- Run 'taplo format --check' to validate TOML file formats."
            	@echo "  $(BOLD)toml-tidy$(SGR0)   -- Run 'taplo format' to fix TOML file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Python$(NC)$(SGR0)"
            	@echo "  $(BOLD)python-test$(SGR0) -- Run 'yapf -r -i -vv --style google --exclude '.cargo/registry' .'"
            	@echo "                 to validate python files against Google style guide."
            	@echo "                 Run 'flake8 --exclude '.cargo/registry' .' to validate python files against flake8 style guide."
            	@echo "  $(BOLD)python-tidy$(SGR0) -- Run 'black --extend-exclude .cargo ' to fix python style formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(NC)$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                 to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml | "
            	@echo "                      sort --ignore-case >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Combined targets$(NC)$(SGR0)"
            	@echo "  $(BOLD)test$(SGR0) -- Run targets; rust-check rust-test rust-clippy rust-fmt toml-test python-test cspell-test"
            	@echo "  $(BOLD)tidy$(SGR0) -- Run targets; rust-tidy toml-tidy python-tidy"
            
            	@echo "  $(BOLD)run$(SGR0)  -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)stop$(SGR0) -- Run 'docker kill ${DOCKER_NAME}-run && docker rm ${DOCKER_NAME}-run' to stop and cleanup our docker after running"
            	@echo "  $(BOLD)all$(SGR0)  -- Run targets; test build release run"
            
            
            # Rust / cargo targets
            check-cargo-registry:
            	if [ ! -d "$(PWD)/.cargo/registry" ]; then mkdir -p "$(PWD)/.cargo/registry" ; fi
            
            build: check-cargo-registry
            	@$(call cargo_run,build)
            
            release:
            	@$(call cargo_run,build,--release --target $(RELEASE_TARGET))
            
            publish:
            	@$(call cargo_run,publish,--dry-run --target $(RELEASE_TARGET))
            
            clean: check-cargo-registry
            	@$(call cargo_run,clean)
            
            rust-check: check-cargo-registry
            	@$(call cargo_run,check)
            
            rust-test: check-cargo-registry
            	@$(call cargo_run,test,--all)
            
            rust-clippy: check-cargo-registry
            	@$(call cargo_run,clippy,--all -- -D warnings)
            
            rust-fmt: check-cargo-registry
            	@echo "$(YELLOW)Running and checking Rust codes formats...$(NC)"
            	@$(call cargo_run,fmt,--all -- --check)
            
            rust-tidy: check-cargo-registry
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call cargo_run,fmt,--all)
            
            # TOML / taplo targets
            toml-test:
            	@echo "$(YELLOW)Running toml file formatting tests...$(NC)"
            	@$(call docker_run,taplo format --check)
            
            toml-tidy:
            	@echo "$(YELLOW)Running toml file formatting fixes...$(NC)"
            	@$(call docker_run,taplo format)
            
            # Python / yapf, flake8 targets
            python-test:
            	@echo "$(YELLOW)Formatting and checking Python files with Google style...$(NC)"
            	@$(call docker_run,yapf -r -i -vv --style google --exclude '.cargo/registry' .)
            	@echo "$(YELLOW)Formatting and checking Python files with flake8 style...$(NC)"
            	@$(call docker_run,flake8 --exclude '.cargo/registry' .)
            
            python-tidy:
            	@echo "$(YELLOW)Running python file formatting fixes...$(NC)"
            	@$(call docker_run,black --extend-exclude .cargo .)
            
            # editorconfig targets
            editorconfig-test:
            	@echo "$(YELLOW)Checking if the codebase is compliant with the .editorconfig file...$(NC)"
            	@docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -v "$(PWD):/usr/src/app" \
                -t mstruebing/editorconfig-checker
            
            # cspell targets
            cspell-test:
            	@echo "$(YELLOW)Checking for spelling errors...$(NC)"
          - 	@cspell --words-only --unique "**/**" -c .cspell.config.yaml
          + 	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            # cspell add words
            cspell-add-words:
            	@echo "$(YELLOW)Adding words to the project's cspell word list...$(NC)"
          - 	@cspell --words-only --unique "**/**" -c .cspell.config.yaml | sort --ignore-case >> .cspell.project-words.txt
          + 	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml | sort --ignore-case >> .cspell.project-words.txt)
            
            # Combined targets
            test: rust-check rust-test rust-clippy rust-fmt toml-test python-test
            tidy: rust-tidy toml-tidy python-tidy
            
            run: stop
                # Run docker container as a daemon and map a port
            	@$(call docker_run,sh,-d -p $(HOST_PORT):$(DOCKER_PORT))
            
            stop:
            	@docker kill ${DOCKER_NAME}-run || true
            	@docker rm ${DOCKER_NAME}-run || true
            
            all: test build release run
            
        EOT
        id                  = "svc-scheduler/Makefile"
        # (9 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieG"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            SHELL := /bin/bash
            
            DOCKER_NAME      := arrow-lib-storage
            IMAGE_NAME       := lib-storage
            BUILD_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-rust
            BUILD_IMAGE_TAG  := latest
            DOCKER_PORT      := 8080
            HOST_PORT        := 8002
            
            # We might not have a Cargo.toml file in the root dir
            CARGO_MANIFEST_PATH ?= $(shell find -maxdepth 2 -name Cargo.toml)
            CARGO_INCREMENTAL   ?= 1
            RUSTC_BOOTSTRAP     ?= 0
            RELEASE_TARGET      ?= x86_64-unknown-linux-musl
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            NC     := $(shell echo -e `tput setaf 9`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -e CARGO_INCREMENTAL=$(CARGO_INCREMENTAL) \
                -e RUSTC_BOOTSTRAP=$(RUSTC_BOOTSTRAP) \
                -v "$(PWD):/usr/src/app" \
                -v "$(PWD)/.cargo/registry:/usr/local/cargo/registry" \
                $(2) \
                -t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
                $(1)
            
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            cargo_run = echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo check...$(NC)$(SGR0)"
            else
            cargo_run = $(call docker_run,cargo $(1) --manifest-path "$(CARGO_MANIFEST_PATH)" $(2))
            endif
            
            help:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(NC)$(SGR0)"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Rust$(NC)$(SGR0)"
            	@echo "  $(YELLOW)All cargo commands will use '--manifest-path $(CARGO_MANIFEST_PATH)'$(NC)"
            	@echo "  $(BOLD)build$(SGR0)       -- Run 'cargo build'"
            	@echo "  $(BOLD)release$(SGR0)     -- Run 'cargo build --release --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)publish$(SGR0)     -- Run 'cargo publish --dry-run --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)clean$(SGR0)       -- Run 'cargo clean'"
            	@echo "  $(BOLD)rust-check$(SGR0)  -- Run 'cargo check'"
            	@echo "  $(BOLD)rust-test$(SGR0)   -- Run 'cargo test --all'"
            	@echo "  $(BOLD)rust-clippy$(SGR0) -- Run 'cargo clippy --all -- -D warnings'"
            	@echo "  $(BOLD)rust-fmt$(SGR0)    -- Run 'cargo fmt --all -- --check' to check rust file formats."
            	@echo "  $(BOLD)rust-tidy$(SGR0)   -- Run 'cargo fmt --all' to fix rust file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)TOML$(NC)$(SGR0)"
            	@echo "  $(BOLD)toml-test$(SGR0)   -- Run 'taplo format --check' to validate TOML file formats."
            	@echo "  $(BOLD)toml-tidy$(SGR0)   -- Run 'taplo format' to fix TOML file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Python$(NC)$(SGR0)"
            	@echo "  $(BOLD)python-test$(SGR0) -- Run 'yapf -r -i -vv --style google --exclude '.cargo/registry' .'"
            	@echo "                 to validate python files against Google style guide."
            	@echo "                 Run 'flake8 --exclude '.cargo/registry' .' to validate python files against flake8 style guide."
            	@echo "  $(BOLD)python-tidy$(SGR0) -- Run 'black --extend-exclude .cargo ' to fix python style formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(NC)$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                 to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml | "
            	@echo "                      sort --ignore-case >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Combined targets$(NC)$(SGR0)"
            	@echo "  $(BOLD)test$(SGR0) -- Run targets; rust-check rust-test rust-clippy rust-fmt toml-test python-test cspell-test"
            	@echo "  $(BOLD)tidy$(SGR0) -- Run targets; rust-tidy toml-tidy python-tidy"
            
            	@echo "  $(BOLD)run$(SGR0)  -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)stop$(SGR0) -- Run 'docker kill ${DOCKER_NAME}-run && docker rm ${DOCKER_NAME}-run' to stop and cleanup our docker after running"
            	@echo "  $(BOLD)all$(SGR0)  -- Run targets; test build release run"
            
            
            # Rust / cargo targets
            check-cargo-registry:
            	if [ ! -d "$(PWD)/.cargo/registry" ]; then mkdir -p "$(PWD)/.cargo/registry" ; fi
            
            build: check-cargo-registry
            	@$(call cargo_run,build)
            
            release:
            	@$(call cargo_run,build,--release --target $(RELEASE_TARGET))
            
            publish:
            	@$(call cargo_run,publish,--dry-run --target $(RELEASE_TARGET))
            
            clean: check-cargo-registry
            	@$(call cargo_run,clean)
            
            rust-check: check-cargo-registry
            	@$(call cargo_run,check)
            
            rust-test: check-cargo-registry
            	@$(call cargo_run,test,--all)
            
            rust-clippy: check-cargo-registry
            	@$(call cargo_run,clippy,--all -- -D warnings)
            
            rust-fmt: check-cargo-registry
            	@echo "$(YELLOW)Running and checking Rust codes formats...$(NC)"
            	@$(call cargo_run,fmt,--all -- --check)
            
            rust-tidy: check-cargo-registry
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call cargo_run,fmt,--all)
            
            # TOML / taplo targets
            toml-test:
            	@echo "$(YELLOW)Running toml file formatting tests...$(NC)"
            	@$(call docker_run,taplo format --check)
            
            toml-tidy:
            	@echo "$(YELLOW)Running toml file formatting fixes...$(NC)"
            	@$(call docker_run,taplo format)
            
            # Python / yapf, flake8 targets
            python-test:
            	@echo "$(YELLOW)Formatting and checking Python files with Google style...$(NC)"
            	@$(call docker_run,yapf -r -i -vv --style google --exclude '.cargo/registry' .)
            	@echo "$(YELLOW)Formatting and checking Python files with flake8 style...$(NC)"
            	@$(call docker_run,flake8 --exclude '.cargo/registry' .)
            
            python-tidy:
            	@echo "$(YELLOW)Running python file formatting fixes...$(NC)"
            	@$(call docker_run,black --extend-exclude .cargo .)
            
            # editorconfig targets
            editorconfig-test:
            	@echo "$(YELLOW)Checking if the codebase is compliant with the .editorconfig file...$(NC)"
            	@docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -v "$(PWD):/usr/src/app" \
                -t mstruebing/editorconfig-checker
            
            # cspell targets
            cspell-test:
            	@echo "$(YELLOW)Checking for spelling errors...$(NC)"
          - 	@cspell --words-only --unique "**/**" -c .cspell.config.yaml
          + 	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            # cspell add words
            cspell-add-words:
            	@echo "$(YELLOW)Adding words to the project's cspell word list...$(NC)"
          - 	@cspell --words-only --unique "**/**" -c .cspell.config.yaml | sort --ignore-case >> .cspell.project-words.txt
          + 	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml | sort --ignore-case >> .cspell.project-words.txt)
            
            # Combined targets
            test: rust-check rust-test rust-clippy rust-fmt toml-test python-test
            tidy: rust-tidy toml-tidy python-tidy
            
            run: stop
                # Run docker container as a daemon and map a port
            	@$(call docker_run,sh,-d -p $(HOST_PORT):$(DOCKER_PORT))
            
            stop:
            	@docker kill ${DOCKER_NAME}-run || true
            	@docker rm ${DOCKER_NAME}-run || true
            
            all: test build release run
            
        EOT
        id                  = "svc-storage/Makefile"
        # (9 unchanged attributes hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXs"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4BqmXz"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4Bqprl"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            SHELL := /bin/bash
            
            DOCKER_NAME      := arrow-svc-rust
            IMAGE_NAME       := svc-rust
            BUILD_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-rust
            BUILD_IMAGE_TAG  := latest
            DOCKER_PORT      := 8080
            HOST_PORT        := 8080
            
            # We might not have a Cargo.toml file in the root dir
            CARGO_MANIFEST_PATH ?= $(shell find -maxdepth 2 -name Cargo.toml)
            CARGO_INCREMENTAL   ?= 1
            RUSTC_BOOTSTRAP     ?= 0
            RELEASE_TARGET      ?= x86_64-unknown-linux-musl
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            NC     := $(shell echo -e `tput setaf 9`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -e CARGO_INCREMENTAL=$(CARGO_INCREMENTAL) \
                -e RUSTC_BOOTSTRAP=$(RUSTC_BOOTSTRAP) \
                -v "$(PWD):/usr/src/app" \
                -v "$(PWD)/.cargo/registry:/usr/local/cargo/registry" \
                $(2) \
                -t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
                $(1)
            
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            cargo_run = echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo check...$(NC)$(SGR0)"
            else
            cargo_run = $(call docker_run,cargo $(1) --manifest-path "$(CARGO_MANIFEST_PATH)" $(2))
            endif
            
            help:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(NC)$(SGR0)"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Rust$(NC)$(SGR0)"
            	@echo "  $(YELLOW)All cargo commands will use '--manifest-path $(CARGO_MANIFEST_PATH)'$(NC)"
            	@echo "  $(BOLD)build$(SGR0)       -- Run 'cargo build'"
            	@echo "  $(BOLD)release$(SGR0)     -- Run 'cargo build --release --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)publish$(SGR0)     -- Run 'cargo publish --dry-run --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)clean$(SGR0)       -- Run 'cargo clean'"
            	@echo "  $(BOLD)rust-check$(SGR0)  -- Run 'cargo check'"
            	@echo "  $(BOLD)rust-test$(SGR0)   -- Run 'cargo test --all'"
            	@echo "  $(BOLD)rust-clippy$(SGR0) -- Run 'cargo clippy --all -- -D warnings'"
            	@echo "  $(BOLD)rust-fmt$(SGR0)    -- Run 'cargo fmt --all -- --check' to check rust file formats."
            	@echo "  $(BOLD)rust-tidy$(SGR0)   -- Run 'cargo fmt --all' to fix rust file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)TOML$(NC)$(SGR0)"
            	@echo "  $(BOLD)toml-test$(SGR0)   -- Run 'taplo format --check' to validate TOML file formats."
            	@echo "  $(BOLD)toml-tidy$(SGR0)   -- Run 'taplo format' to fix TOML file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Python$(NC)$(SGR0)"
            	@echo "  $(BOLD)python-test$(SGR0) -- Run 'yapf -r -i -vv --style google --exclude '.cargo/registry' .'"
            	@echo "                 to validate python files against Google style guide."
            	@echo "                 Run 'flake8 --exclude '.cargo/registry' .' to validate python files against flake8 style guide."
            	@echo "  $(BOLD)python-tidy$(SGR0) -- Run 'black --extend-exclude .cargo ' to fix python style formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(NC)$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                 to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml | "
            	@echo "                      sort --ignore-case >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Combined targets$(NC)$(SGR0)"
            	@echo "  $(BOLD)test$(SGR0) -- Run targets; rust-check rust-test rust-clippy rust-fmt toml-test python-test cspell-test"
            	@echo "  $(BOLD)tidy$(SGR0) -- Run targets; rust-tidy toml-tidy python-tidy"
            
            	@echo "  $(BOLD)run$(SGR0)  -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)stop$(SGR0) -- Run 'docker kill ${DOCKER_NAME}-run && docker rm ${DOCKER_NAME}-run' to stop and cleanup our docker after running"
            	@echo "  $(BOLD)all$(SGR0)  -- Run targets; test build release run"
            
            
            # Rust / cargo targets
            check-cargo-registry:
            	if [ ! -d "$(PWD)/.cargo/registry" ]; then mkdir -p "$(PWD)/.cargo/registry" ; fi
            
            build: check-cargo-registry
            	@$(call cargo_run,build)
            
            release:
            	@$(call cargo_run,build,--release --target $(RELEASE_TARGET))
            
            publish:
            	@$(call cargo_run,publish,--dry-run --target $(RELEASE_TARGET))
            
            clean: check-cargo-registry
            	@$(call cargo_run,clean)
            
            rust-check: check-cargo-registry
            	@$(call cargo_run,check)
            
            rust-test: check-cargo-registry
            	@$(call cargo_run,test,--all)
            
            rust-clippy: check-cargo-registry
            	@$(call cargo_run,clippy,--all -- -D warnings)
            
            rust-fmt: check-cargo-registry
            	@echo "$(YELLOW)Running and checking Rust codes formats...$(NC)"
            	@$(call cargo_run,fmt,--all -- --check)
            
            rust-tidy: check-cargo-registry
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call cargo_run,fmt,--all)
            
            # TOML / taplo targets
            toml-test:
            	@echo "$(YELLOW)Running toml file formatting tests...$(NC)"
            	@$(call docker_run,taplo format --check)
            
            toml-tidy:
            	@echo "$(YELLOW)Running toml file formatting fixes...$(NC)"
            	@$(call docker_run,taplo format)
            
            # Python / yapf, flake8 targets
            python-test:
            	@echo "$(YELLOW)Formatting and checking Python files with Google style...$(NC)"
            	@$(call docker_run,yapf -r -i -vv --style google --exclude '.cargo/registry' .)
            	@echo "$(YELLOW)Formatting and checking Python files with flake8 style...$(NC)"
            	@$(call docker_run,flake8 --exclude '.cargo/registry' .)
            
            python-tidy:
            	@echo "$(YELLOW)Running python file formatting fixes...$(NC)"
            	@$(call docker_run,black --extend-exclude .cargo .)
            
            # editorconfig targets
            editorconfig-test:
            	@echo "$(YELLOW)Checking if the codebase is compliant with the .editorconfig file...$(NC)"
            	@docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -v "$(PWD):/usr/src/app" \
                -t mstruebing/editorconfig-checker
            
            # cspell targets
            cspell-test:
            	@echo "$(YELLOW)Checking for spelling errors...$(NC)"
          - 	@cspell --words-only --unique "**/**" -c .cspell.config.yaml
          + 	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            # cspell add words
            cspell-add-words:
            	@echo "$(YELLOW)Adding words to the project's cspell word list...$(NC)"
          - 	@cspell --words-only --unique "**/**" -c .cspell.config.yaml | sort --ignore-case >> .cspell.project-words.txt
          + 	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml | sort --ignore-case >> .cspell.project-words.txt)
            
            # Combined targets
            test: rust-check rust-test rust-clippy rust-fmt toml-test python-test
            tidy: rust-tidy toml-tidy python-tidy
            
            run: stop
                # Run docker container as a daemon and map a port
            	@$(call docker_run,sh,-d -p $(HOST_PORT):$(DOCKER_PORT))
            
            stop:
            	@docker kill ${DOCKER_NAME}-run || true
            	@docker rm ${DOCKER_NAME}-run || true
            
            all: test build release run
            
        EOT
        id                  = "svc-template-rust/Makefile"
        # (9 unchanged attributes hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXu"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXx"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_tf["github"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOG6VIns4BpLGe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 19 to add, 29 to change, 0 to destroy.

Changes to Outputs:
  ~ repositories = {
      ~ se-services     = {
          ~ branch         = {
              ~ develop = {
                  ~ etag          = "W/\"9e7934f3548f56c3085be3f63b6825af20930bebad3859b8fb1e979b2dd916ba\"" -> "W/\"b3c8842f4207ccf85f03f220f2ecf75363d944ad5e2bce70209e96174f2580de\""
                    id            = "se-services:develop"
                    # (6 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
      ~ tool-simulation = {
          ~ branch         = {
              ~ develop = {
                  ~ etag          = "W/\"089f01058f12e04035877102bd3a429bc1cae550b916acbda32c8467a47b4c13\"" -> "W/\"74b308c133613935468fddd66833063fe79ce07f499a0512f57269dc8d9ff60b\""
                    id            = "tool-simulation:develop"
                    # (6 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
      ~ website         = {
          ~ branch         = {
              ~ staging = {
                  ~ etag          = "W/\"fc58d93b3ea16a79dede125c2bc9cd7dddbddcd70ec05c971f790158ad389f46\"" -> "W/\"8906602e342233383a8e01596611d55c8bf19b3b5aa8c8644f1e537bbc91a51a\""
                    id            = "website:staging"
                    # (6 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
        # (4 unchanged elements hidden)
    }

```

</details>

*Pusher: @owlot, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*